import { Lang } from "./Lang";

const lang: Lang = "zh";

export function getLang() {
    return lang;
}

export function tHelper<K extends string>(
    i18n: {
        [L in Lang]: {
            [k in K]: string;
        };
    },
) {
    return (key: K) => (i18n[lang][key] || "") as string;
}

// 定义每种语言的翻译
export const i18n = {
    zh: {
        //epSwitcher
        "激しく感じてしまった": "激烈地感到",
        "大きく感じてしまった": "剧烈地感到",
        "感じてしまった": "感到",
        "疼いてしまった": "只是轻微地感到",

        //shakeSwitcher
        "激しく擦れて": "激烈地摩擦",
        "大きく擦れて": "剧烈地摩擦",
        "擦れて": "摩擦",
        "少し擦れただけで": "只是轻微地摩擦",
        //shakeSwitcher
        "激しく揺れて": "激烈地摇晃",
        "大きく揺れて": "剧烈地摇晃",
        "揺れて": "摇晃",
        "少し揺れただけで": "只是轻微地摇晃",
        //bustSizeSwitcher
        "戦えない爆乳":"P cup",
        "生活に困るレベルの爆乳":"N cup",
        "規格外爆乳":"L cup",
        "はちきれんばかりの爆乳":"J cup",
        "爆乳":"H cup",
        "豊満な":"F cup",
        "大きな":"D cup",
        "ふくらみかけの":"A cup",
        "ぺったんこな":"平板",
        //sensitivitySwitcher
        "開発された": "敏感 lv 1",
        "感じやすい": "敏感 lv 2",
        "敏感な": "敏感 lv 3",
        "とても敏感な": "敏感 lv 3",
        "過敏で感じすぎる": "敏感 lv 4",
        "過敏すぎて生活もままならない": "敏感 lv 5",

        "街": "街道",
        "ダンジョン": "地下城",
        "敗北してしまった!": "败北了",
        "勝利した!": "胜利！",
        "アリス": "爱丽丝",
        "スライム": "史莱姆",
        "はダメージを受けなかった": "没有受到伤害。",
        "の攻撃は効果が無い！": "的攻击无效！",
        "ターン": "回合",
        "の攻撃！": "发动攻击！",
        "は攻撃をかわしダメージを受けなかった。": "成功躲避了攻击，没有受到伤害。",
        "の攻撃は外れた！": "的攻击打偏了！",
        "は余裕の表情だ。": "面带从容的表情。",
        "は快感で集中できず攻撃失敗してしまった！": "由于快感中无法集中，攻击失败！",
        "人は周囲を探索したがなにもなかった": "人探索周围，但什么也没有找到",
        "バトル開始!": "战斗开始!",
        "おもらし": "失禁",
        "おもらし性感": "失禁快感",
        "射乳": "泌乳",
    },
};

// 翻译方法
export const TR = (key: string,TrObj?:any): string => {
    let i = TrObj || i18n;
    // 使用类型断言确保 lang 是 i18n 中的有效键
    return i[lang as keyof typeof i18n]?.[key as keyof typeof i18n["zh"]] || key;
};



